In [1]:
import pandas as pd
import numpy as np

In [91]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [56]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

PS -1

In [101]:
def FlightNumber_Filtered(tst,length):
    for i in range(length):
        if tst[i] != tst[i]:
            tst[i] = tst[i-1]+10
    return tst

In [104]:
df['FlightNumber'] = FlightNumber_Filtered(df['FlightNumber'],df.shape[0])
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

PS 2:

In [123]:
def FromTo_Filtered(From_To,num):
    from_lst = []
    to_lst = []
    for i in range(num):
        x,y =(From_To[i].split('_'))
        from_lst.append(x)
        to_lst.append(y)
    return from_lst,to_lst

In [127]:
df1 = pd.DataFrame()
df1['From'],df1['To'] = FromTo_Filtered(df['From_To'],df.shape[0])

In [131]:
df1['From'] = df1['From'].str.capitalize()
df1['To'] = df1['To'].str.capitalize()
df1

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [139]:
df.drop(columns=['From_To'],inplace=True)

   FlightNumber  RecentDelays              Airline
0       10045.0      [23, 47]               KLM(!)
1       10055.0            []    <Air France> (12)
2       10065.0  [24, 43, 87]  (British Airways. )
3       10075.0          [13]       12. Air France
4       10085.0      [67, 32]          "Swiss Air"

In [143]:
df.insert(1,"From",df1["From"])
df.insert(2,"To",df1["To"])
df

   FlightNumber      From         To  RecentDelays              Airline
0       10045.0    London      Paris      [23, 47]               KLM(!)
1       10055.0    Madrid      Milan            []    <Air France> (12)
2       10065.0    London  Stockholm  [24, 43, 87]  (British Airways. )
3       10075.0  Budapest      Paris          [13]       12. Air France
4       10085.0  Brussels     London      [67, 32]          "Swiss Air"

PS : 5

In [213]:
delay_lst = pd.DataFrame(df['RecentDelays'].values.tolist()) 
col_dict ={} 
num = delay_lst.shape[1]

for i in range(num): 
    Key = delay_lst.columns[i]
    Value = "Delay" + str(i+1) 
    col_dict[Key] = Value

In [217]:
for i in range(num):
    char = str(i)
    df.insert(i+4,col_dict[i],"Delay"+char)

In [220]:
df.drop(columns='RecentDelays',inplace=True)

In [221]:
df

,FlightNumber,From,To,Delay1,Delay2,Delay3,Airline
0,10045.0,London,Paris,Delay0,Delay1,Delay2,KLM(!)
1,10055.0,Madrid,Milan,Delay0,Delay1,Delay2,<Air France> (12)
2,10065.0,London,Stockholm,Delay0,Delay1,Delay2,(British Airways. )
3,10075.0,Budapest,Paris,Delay0,Delay1,Delay2,12. Air France
4,10085.0,Brussels,London,Delay0,Delay1,Delay2,"""Swiss Air"""